<?php
$title = "Карта сайта";
include getcwd() . "/header.php";
?>




<div class="container body-content">
    <div class="row">
        <div class="col">

            <?php
            include getcwd() . '/toc_generator.php';


            generate_toc();

            ?>

            Тяжёлый путь хоббитов.
            Продолжаю путешествовать по Средиземью вместе с героями.
            Вторая книга и фильм все же разные. В фильм, как и в первой части, не вошли некоторые сцены, и были существенно изменены остальные, учитывая мрачную идею экранизации. Допустим в книге энты не такие злые и более величественные, а хоббиты более позитивные. Война и сражения разные. По фильму люди бежали от орков в поисках убежища, в книге воины отправились сражаться с врагов, а мирные жители остались на своих местах. Книга вообще целиком состоит из мужских персонажей, зато в экранизации женщин немного выдвинули вперёд, за что им большое спасибо. В итоге, как и сказала в своей первой рецензии, книга и фильм гармонично дополняют друг друга и здесь это еще более отчётливо бросается в глаза. Прочитав вторую книгу картинка стала объемнее. Пара слов о Хоббитах...
            Хоббиты интересные персонажи, хотя главы с участием Фродо и Сэма и могут на первый взгляд показаться немного скучными.
            Всех Хоббитов, в том числе и Бильбо, хочется подравнять под одно определение, которое, на мой взгляд, хорошо показывает их место в трилогии.
            "Даже самый маленький и слабый человек, может нести на своих плечах тяжёлую ношу и совершать подвиги.
            Для того, что бы быть героем не обязательно быть первоклассным воином или принцем."
            Во-второй книге образ хоббитов по этой теории как раз хорошо раскрывается.
            Четыре хоббита отправились из родных краёв с миссией, важность которую они до конца даже не понимали.
            В результате случая их дороги разделились.
            Два Хоббита отправились с кольцом к роковой горе, двух других похитили злобные орки.
            Трое воинов: эльф, гном и человек спешат на выручку, но по сути они в этом не нуждаются.
            Здесь конечно поработала удача, но и находчивость маленьких человечков сыграла свою роль.
            Пин и Мэри знакомятся с энтами, живыми деревьями, которые в дальнейшем захватили одну из твердынь.
            Там конечно и без Гендальфа не обошлось, но все таки рычагом к действию, как мне кажется, были именно они.
            Голлум тоже не так прост как кажется.
            Он вроде наглядного примера для Фродо, что будет с ним, если он позволит кольцу завладеть своим разумом.
            Они как инь и ян.
            Эгоистичное зло, зацикленное на одной идеи, и безграничное добро, которое рискуя собой пытается спасти мир.
            В итоге на мой взгляд книга интересная и поучительная, есть над чем задуматься.
            Продолжаю читать...

            Подробнее на livelib.ru:
            https://www.livelib.ru/review/1719922-vlastelin-kolets-dve-tverdyni-dzhon-r-r-tolkin


        </div>
    </div>
</div>

<?php
include getcwd() . "/footer.php";
?>